//
//  String.swift
//  Test1
//
//  Created by Anton on 28.11.2018.
//  Copyright © 2018 Tohaman. All rights reserved.
//
import Foundation

struct Begin3x3: Phases {
    func phase() -> String {
        let phase = "BEGIN3X3"
        return phase
    }
    
    func titles() -> [String] {
        return title
    }
    
    func images() -> [String] {
        return image
    }
    
    func descs() -> [String] {
        return description
    }
    
    func urls() -> [String] {
        return url
    }
    
    func comments() -> [String] {
        return []
    }
    
    let title = [
        st1_title,
        st2_title,
        st3_title,
        st4_title,
        st5a_title,
        st5b_title,
        st6_title,
        st7_title,
        st8_title,
        st9_title]
    
    let image = [
        "begin_1",
        "begin_2",
        "begin_3",
        "begin_4",
        "begin_5a",
        "begin_5b",
        "begin_6",
        "begin_7",
        "begin_8",
        "begin_9"]
   
    let url = [
        st1_url,
        st2_url,
        st3_url,
        st4_url,
        st5a_url,
        st5b_url,
        st6_url,
        st7_url,
        st8_url,
        st9_url
    ]
    
    
    let description = [
        st1_description,
        st2_description,
        st3_description,
        st4_description,
        st5a_description,
        st5b_description,
        st6_description,
        st7_description,
        st8_description,
        st9_description]
    
    
    static let st1_title = "Этап1. Выбор стороны"
    static let st1_description = """
        <p>Начнем с плюсов этой методики. Их несколько: небольшое количество алгоритмов для запоминания (всего 5), простота этих алгоритмов, и самое главное <b>нестандартный способ запоминания</b> этих алгоритмов. Еще одним огромным плюсом данной методики является возможность постепенного, плавного перехода к скоростной сборке по методу Джессики Фридрих (он же CFOP).</p>
        <p style="text-align:center"><img src="begin_1_1.xml" width="20%%"></p>

        <p>Первым делом нужно выбрать сторону с которой вы начнете собирать кубик. Сборку можно начать с абсолютно любой стороны.</p>

        <p>В иллюстрациях к данному курсу будем считать, что это белая сторона, а серым цветом в кубике будем указывать наклейки цвет которых не имеет значения. Теперь представьте, что кубик это трехэтажный дом с крышей того цвета, что вы сейчас выбрали
        и вертолетной площадкой на крыше. На протяжении нескольких следующих этапов постарайтесь не уронить вертолет стоящий на площадке (держите кубик выбранной стороной всегда вверх). Вот и весь <a href="rg2://ytplay?time=2:12&link=0TvO_rpG_aM">первый этап.</a></p>

        <p>Более подробно все сказанное выше (впрочем как и для всех остальных этапов методики для начинающих) рассмотрено в видео от Максима Чечнева чуть ниже. Или вы можете щелкнуть по выделенному тексту чтобы сразу начать просмотр видео именно с того момента, о котором написано в тексте.</p>
    """
    static let st1_url = "0TvO_rpG_aM"
    
    static let st2_title = "Этап 2. Нижний крест"
    static let st2_description = """
    <p>На данном этапе обращаем внимание только на <a href="rg2://ytplay?time=1:45&link=8VCsFNFa5yM">ребра кубика,</a> а углы не замечаем, они нас пока не интересуют. Наша задача поставить на место четыре ребра, причем ищем только ребра того цвета, <a href="rg2://ytplay?time=2:22&link=8VCsFNFa5yM"> который выбрали</a> на первом этапе. Так же на данном этапе, мы узнаем что такое <a href="rg2://ytplay?time=11:15&link=8VCsFNFa5yM">\"поездка в Лондон\"</a> и <a href="rg2://ytplay?time=7:58&link=8VCsFNFa5yM">\"едет крыша\"</a> применительно к данной методике сборки кубика.</p>
    <p>И для начала ищем наши ребра на <a href="rg2://ytplay?time=5:54&link=8VCsFNFa5yM">втором этаже</a> нашего трехэтажного дома (в хороших, дорогих квартирах).</p>
    <p style="text-align:center"><img src="begin_2_1.xml" width="40%%"></p>

    <p>Если находим такое ребро, то ставим его \"на крышу\" одним поворотом соответствующей (правой или левой) грани. Если поворот грани смещает со своего места <a href="rg2://ytplay?time=7:13&link=8VCsFNFa5yM">другое ребро</a> на крыше, т.е. место уже
        занято, то <a href="rg2://ytplay?time=7:58&link=8VCsFNFa5yM">нам становится сложно</a> и у нас от этого \"едет крыша\", т.е. мы крутим верхнюю грань. И снова пробуем поставить ребро \"на крышу\". Если место снова занято, то опять \"едет крыша\" и т.д. пока не найдем место для ребра. Продолжаем искать ребра того цвета, что выбрали на первом этапе на втором этаже, если нашлись, ставим "на крышу" по методу описанному выше.</p>

    <p>Если на втором этаже больше ребер нет, а места на крыше еще есть, то поиски ребра <a href="rg2://ytplay?time=9:20&link=8VCsFNFa5yM">продолжаем на третьем этаже</a> в более дешевых (т.к. там периодически течет крыша), чем на втором этаже квартирах.</p>
    <p style="text-align:center"><img src="begin_2_2.xml" width="40%%"></p>
    
    <p><a href="rg2://ytplay?time=10:25&link=8VCsFNFa5yM">И если находим,</a> то сначала нужно наше ребро переселить на второй этаж (в хорошую дорогую квартиру). Для этого мы отправляем его <a href="rg2://ytplay?time=11:15&link=8VCsFNFa5yM">\"в Лондон\"</a> на заработки (крутим переднюю грань по часовой стрелке). Ну а после того как ребро оказалось на втором этаже, мы
        <a href="rg2://ytplay?time=12:25&link=8VCsFNFa5yM">уже знаем что делать</a> (см.выше).</p>

    <p>Если же ни на втором, ни на третьем этаже нужных <a href="rg2://ytplay?time=14:15&link=8VCsFNFa5yM">ребер нет,</a> то ищем их
        <a href="rg2://ytplay?time=15:00&link=8VCsFNFa5yM">на первом этаже</a> (в еще более дешевых квартирах, т.к. там воняет из подвала).</p>
    <p style="text-align:center"><img src="begin_2_3.xml" width="40%%"></p>

    <p><a href="rg2://ytplay?time=15:10&link=8VCsFNFa5yM">И если находим,</a> то надо опять отправить наше ребро "в Лондон" на заработки, причем отправить так, чтобы <a href="rg2://ytplay?time=15:58&link=8VCsFNFa5yM">не сбить с крыши</a>
        уже находящиеся там ребра. Если поездка "в Лондон" сбивает какое-то ребро с крыши, то нам опять становится сложно и у нас "едет крыша" до тех пор, пока не сможем уехать "в Лондон" никого не сбив. После удачной поездки в Лондон ребро оказывается на втором этаже, и что делать в этом случае <a href="rg2://ytplay?time=16:55&link=8VCsFNFa5yM">мы уже знаем.</a></p>

    <p>Ну и если еще не все места на крыше заняты, а <a href="rg2://ytplay?time=21:10&link=8VCsFNFa5yM">наших ребер нет</a> в квартирах ни на втором, ни на третьем, ни на первом этаже, то значит наше ребро бомж и искать его надо в подвале.</p>
    <p style="text-align:center"><img src="begin_2_4.xml" width="40%%"></p>
    
    <p>Находим его, поворачиваем кубик, так чтобы ребро в подвале было <a href="rg2://ytplay?time=21:48&link=8VCsFNFa5yM">максимально близко к нам,</a> затем надо повернуть крышу так, чтобы <a href="rg2://ytplay?time=22:32&link=8VCsFNFa5yM">место для этого ребра</a> тоже было максимально близко к нам и отправить ребро на <a href="rg2://ytplay?time=23:10&link=8VCsFNFa5yM">два года</a> (двойной заработок, т.к. это бомж) "в Лондон".</p>

    <p>Более подробно все сказанное выше (впрочем как и для всех остальных этапов методики для начинающих) рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st2_url = "8VCsFNFa5yM"
    
    static let st3_title = "Этап 3. Правильный крест"
    static let st3_description = """
    <p>На третьем этапе продолжаем <a href="rg2://ytplay?time=1:16&link=ku-FyZvD48Q">заниматься ребрами,</a> теперь надо их <a href="rg2://ytplay?time=2:49&link=ku-FyZvD48Q">совместить со своими центрами.</a> Узнаем, где у кубика <a href="rg2://ytplay?time=8:37&link=ku-FyZvD48Q">выключатель света,</a> что такое <a href="rg2://ytplay?time=8:19&link=ku-FyZvD48Q"><b>пиф-паф</b></a>, а так же кто такие <a href="rg2://ytplay?time=4:20&link=ku-FyZvD48Q">дяди</a> и <a href="rg2://ytplay?time=4:37&link=ku-FyZvD48Q">тети.</a></p>

    <p>Договоримся, что ребро состыкованное со своим центром мы будем называть <a href="rg2://ytplay?time=4:20&link=ku-FyZvD48Q">\"дядей\"</a>, а несостыкованное - <a href="rg2://ytplay?time=4:37&link=ku-FyZvD48Q">\"тетей\".</a></p>

    <p style="text-align:center"><img src="begin_3_2.xml" width="20%%"><br/>
         Это дяди</p>

    <p style="text-align:center"><img src="begin_3_3.xml" width="20%%"><br/>
         А это тети</p>

    <p>Т.е. задача данного этапа, сделать так, чтобы у нас в кубике было 4 дяди. Что для этого нужно сделать:<br/>
        1. Надо покрутить крышу так, чтобы получилось <a href="rg2://ytplay?time=5:01&link=ku-FyZvD48Q">два \"дяди\" и две \"тети\".</a> Всегда есть такое положение крыши, при котором будут два дяди две тети.</p>

    <p>2. Теперь взять <a href="rg2://ytplay?time=6:36&link=ku-FyZvD48Q">кубик так,</a> чтобы один дядя был наглый (смотрел на нас), а второй дядя \"пошел налево\".</p>
    
    <p style="text-align:center"><img src="begin_3_1.xml" width="20%%"><br/></p>

    <p>И выполнить очень простую комбинацию, которая называется <a href="rg2://ytplay?time=8:19&link=ku-FyZvD48Q"><b>пиф-паф</b>.</a></p>

    <p>Чтобы запомнить как делать <a href="rg2://ytplay?time=8:19&link=ku-FyZvD48Q"><b>пиф-паф</b></a> представьте, что вы проснулись ночью и включили свет (повернули правую грань по часовой стрелке) и от яркого света у вас "поехала крыша" (крутим верхнюю грань) тоже по часовой стрелке. Вы выключили свет (правая грань против часовой стрелки) и "крыша" вернулась на свое место (верхняя грань против часовой стрелки). Ну и после пиф-пафа еще надо дополнительно включить свет.</p>
        
    <p>Для уже знающих формулы все вышесказанное выглядит немного проще:<br/>
        <b>(R U R\' U\') R </b>- <b>пиф-паф</b> выделен скобочками.</p>

    <p>Все тети должны стать дядями, т.е. цель третьего этапа выполнена. Но&#8230<br/><br/>

        Если у вас сложилась ситуация, что дяди расположены <a href="rg2://ytplay?time=12:45&link=ku-FyZvD48Q">друг напротив друга</a> и поставить одного к себе, а другого налево не получается, то нужно повернуть кубик тетей к себе и отправить обоих дядей в "тюрьму" (на второй этаж). Повернуть крышу дважды и вернуть дядей на место.</p>

    <p>В этом случае, формула такая: <b>(R\' L) U2 (R L\') U2</b></p>

    <p>Вот что должно у нас получится после выполнения данного этапа (4 дяди):</p>

    <p style="text-align:center"><img src="begin_3.xml" width="20%%"><br/>

    <p>Более подробно все сказанное выше рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st3_url = "ku-FyZvD48Q"
    
    static let st4_title = "Этап 4. Первый (нижний) слой"
    static let st4_description = """
    <p>На этом этапе ставим на место углы выбранной на первом этапе стороны. Для этого переворачиваем кубик данной стороной вниз <a href="rg2://ytplay?time=2:06&link=Vt9dHndW7-E">(в подвал).</a> И начинаем искать нужных нам \"парней\"
        (углы с одной из наклеек цвета выбранного на первом этапе). И ищем их на <a href="rg2://ytplay?time=2:23&link=Vt9dHndW7-E">\"крыше\" или \"третьем этаже\"</a> нашего здания, т.е. на верхней грани.</p>

    <p><a href="rg2://ytplay?time=2:40&link=Vt9dHndW7-E">Если находим,</a> то ставим наш угол в правый верхний ближний угол кубика. Обратите внимание, что на картинках уже собранный крест - белый, а в видео - желтый. Поэтому и на картинках угол с белой наклейкой, а в видео с желтой. Т.е. кубик надо взять как-то так:</p>
    
    <p style="text-align:center"><img src="begin_4_7.xml" width="15%%"><br/>
                                    <img src="begin_4_9.xml" width="15%%"><br/>
                                    <img src="begin_4_10.xml" width="15%%"></p>

    <p>Теперь его надо подогнать к своей квартире. А квартира у него находится между центрами его <a href="rg2://ytplay?time=4:20&link=Vt9dHndW7-E">дополнительных цветов,</a> тех двух цветов, которые не совпадают с цветом креста на нижней грани.<br/>
        Для этого фиксируем крышу и крутим <a href="rg2://ytplay?time=5:50&link=Vt9dHndW7-E">нижние два слоя</a>
        так, чтобы <a href="rg2://ytplay?time=9:01&link=Vt9dHndW7-E">спереди и справа</a> были эти два центра.<br/><br/>
        <p style="text-align:center"><img src="begin_4_8.xml" width="20%%"></p>

        И теперь в зависимости от того <a href="rg2://ytplay?time=9:43&link=Vt9dHndW7-E">какой \"парень\":</a>
        скромный, с завышенной самооценкой
        или наглый делаем соответственно 1, 3 или 5 <a href="rg2://ytplay?time=7:07&link=Vt9dHndW7-E"><b>пиф-паф</b>ов.</a></p>

        <p style="text-align:center"><img src="begin_4_2.xml" width="20%%"></p>
        <p>скромный парень = <a href="rg2://ytplay?time=7:07&link=Vt9dHndW7-E">1 пиф-паф</a></p>

        <p style="text-align:center"><img src="begin_4_3.xml" width="20%%"></p>
        <p>с завышенной самооценкой = <a href="rg2://ytplay?time=10:22&link=Vt9dHndW7-E">3 пиф-пафа</a></p>

        <p style="text-align:center"><img src="begin_4_4.xml" width="20%%"></p>
        <p>наглый парень =  <a href="rg2://ytplay?time=13:25&link=Vt9dHndW7-E">5 пиф-пафов</a></p>

        <p>Если \"парень\" на первом этаже или в подвале, но не на своем месте, то кубик необходимо
        взять так, чтобы \"парень\" оказался в правом ближнем нижнем углу. Например:</p>

        <p style="text-align:center"><img src="begin_4_5.xml" width="15%%"> или <img src="begin_4_6.xml" width="15%%"><br/>

        <p>И поднять его на 3 этаж при помощи все того же <b>пиф-пафа</b>.<br/>
        <b>Алгоритм пиф-пафа: (R U R\' U\')</b>
        А что делать с парнем на 3-ем этаже - смотри выше.</p>

        <p>Алгоритм для более быстрого решения наглых парней будет рассмотрен в Ускорениях для
         начинающих. На данный момент, важнее довести выполнение пиф-пафов до автоматизма. А как их делают
         профессионалы <a href="rg2://ytplay?time=0:06&link=4nSnsav3bIU">смотрите в видео.</a></p>

        <p>Более подробно все сказанное выше рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st4_url = "Vt9dHndW7-E"

    static let st5a_title = "Этап 5а. Два нижних слоя (Ромашки)"
    static let st5a_description = """
        <p>На этом этапе занимаемся ребрами, которые должны находиться на <a href="rg2://ytplay?time=4:48&link=v3J6-5_J29s">втором этаже</a> нашего трехэтажного дома. Поскольку ребра находятся на втором этаже, то искать будем ребра без цвета крыши. А вот искать мы их будем как раз на крыше и третьем этаже, т.е. на верхней грани. И после того, как нашли нужное ребро (<a href="rg2://ytplay?time=6:02&link=v3J6-5_J29s">без цвета крыши</a>)
        крутим два нижних слоя до тех пор, пока нижняя наклейка нашего ребра (находящаяся на третьем этаже) не совпадет по цвету с цветом центра грани, тем самым образовав <a href="rg2://ytplay?time=9:23&link=v3J6-5_J29s"><b>стебель ромашки</b></a> (три одинаковые вертикально стоящие наклейки).</p>

        <p style="text-align:center"><img src="begin_5_4.xml" width="20%%"></p>

        <p>Теперь смотрим на верхнюю (находящуюся на крыше) наклейку и сравниваем ее цвет с цветом центров граней находящихся слева и справа, тем самым определив тип нашей ромашки: у нас <a href="rg2://ytplay?time=17:08&link=v3J6-5_J29s"><b>ромашка налево</b></a> или <a href="rg2://ytplay?time=11:21&link=v3J6-5_J29s"><b>ромашка направо</b></a>. Далее <a href="rg2://ytplay?time=11:47&link=v3J6-5_J29s">поворачиваем кубик</a> так, чтобы стебель ромашки был справа и крутим поочередно <b>только правую и верхнюю грани</b> кубика начиная с правой:</p>

        <p>- если у нас <a href="rg2://ytplay?time=12:11&link=v3J6-5_J29s"><b>ромашка направо</b></a>, то сначала 5 раз по часовой, затем 5 раз против часовой стрелки.</p>

        <p style="text-align:center"><img src="begin_5_1.xml" width="20%%"></p>
        <p><b>Алгоритм: (R U R U R) (U\' R\' U\' R\' U\')</b></p>

        <p>- если <a href="rg2://ytplay?time=17:53&link=v3J6-5_J29s"><b>ромашка налево</b></a>, то сначала 5 раз против часовой, а затем 5 раз по часовой стрелке.</p>

        <p style="text-align:center"><img src="begin_5_2.xml" width="20%%"></p>
        <p><b>Алгоритм: (R\' U\' R\' U\' R\') (U R U R U)</b></p>

        <p>Более подробно все сказанное выше рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st5a_url = "v3J6-5_J29s"

    static let st5b_title = "Этап 5б. Два нижних слоя (Желтый одуванчик)"
    static let st5b_description = """
     <p>Если на третьем этаже (крыше) все ребра с наклейками с цветом крыши, а два нижних слоя еще не собраны (например, как на этой картинке).</p>

     <p style="text-align:center"><img src="begin_5_3.xml" width="20%%"></p>

     <p>Это значит, вы попали в ситуацию "желтый одуванчик", и вот как она решается:<br/>
        надо "поднять" неверно стоящее на втором этаже ребро на третий этаж, не сбив остальные ребра стоящие на своих местах. И для этого необходимо поместить его спереди справа и выполнить "ромашку налево". После чего ребро окажется на третьем этаже, и что делать с ним в этом случаем, мы уже знаем.</p>

    <p>Более подробно все сказанное выше рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st5b_url = "fad9teqrKVo"

    static let st6_title = "Этап 6. Верхний крест (Оружие)"
    static let st6_description = """
    <p>И снова занимаемся ребрами, но уже ребрами цвета крыши. В итоге у нас должен будет получиться крест на верхней грани кубика. Но пока крест не собран. И чтобы было легче определить комбинацию которую нам придется решать, можно/нужно
        <a href="rg2://ytplay?time=10:38&link=8C0Dn2Y7jUY">закрыть углы пальцами.</a> Итак, на данном этапе мы видим только оружие: палку (три в ряд), бумеранг (три буквой Г) или пулю (все ребра не в цвет крыши). Как их решать: </p>

        <p>- <a href="rg2://ytplay?time=8:05&link=8C0Dn2Y7jUY"><b>Палка.</b></a></p>
        <p style="text-align:center"><img src="begin_6_1.xml" width="20%%"></p>

        <p>Палку надо поставить так чтобы она нас не била (на 3 и 9 часов), <a href="rg2://ytplay?time=9:15&link=8C0Dn2Y7jUY">теперь</a> едем в Лондон, делаем пиф-паф, возвращаемся из Лондона.<br/>
        <b>Алгоритм: F (R U R\' U\') F\'</b></p>

        <p>- <a href="rg2://ytplay?time=11:07&link=8C0Dn2Y7jUY"><b>Бумеранг.</b></a></p>
        <p style="text-align:center"><img src="begin_6_2.xml" width="20%%"></p>

        <p>Его надо поставить на 9 и 12 часов (налево и назад), т.к. бумеранг более совершенное оружие, чем палка, то выполнять его чуть сложнее. Едем в Лондон и делаем 2 (два) пиф-пафа, и возвращаемся из Лондона.<br/>
            <b>Алгоритм: F (R U R\' U\') (R U R\' U\') F\'</b></p>

        <p>- <a href="rg2://ytplay?time=13:57&link=8C0Dn2Y7jUY"><b>Пуля.</b></a></p>
        <p style="text-align:center"><img src="begin_6_3.xml" width="20%%"></p>

        <p>Как ставить, абсолютно без разницы. Пуля еще более совершенное оружие, поэтому комбинация еще сложнее. Делаем <b>палку</b> (едем в Лондон, делаем пиф-паф, возвращаемся из Лондона), получаем из пули <b>бумеранг</b>, поворачиваем его как надо (на 9 и 12) и делаем <b>бумеранг</b> ( Едем в Лондон и делаем 2 пиф-пафа, и возвращаемся из Лондона).<br/>
            <b>Алгоритм: (F (R U R\' U\') F\') U2 (F (R U R\' U\') (R U R\' U\') F\')</b></p>

        <p>Более подробно все сказанное выше рассмотрено в видео от Максима Чечнева чуть ниже.</p>
    """
    static let st6_url = "8C0Dn2Y7jUY"

    static let st7_title = "Этап 7. Красим крышу"
    static let st7_description = "<p>Всякий текст №7</p>"
    static let st7_url = "u9vBRWSVBA8"

    static let st8_title = "Этап 8. Ставим ребра (Убийство в Лондоне)"
    static let st8_description = "<p>Всякий текст №8</p>"
    static let st8_url = "oU5LJmWefDw"

    static let st9_title = "Этап 9. Треугольники (Инфаркт)"
    static let st9_description = "<p>Всякий текст №9</p>"
    static let st9_url = "dGh_gjwsfe0"
    
}
