//
//  Rozov3x3.swift
//  RG2
//
//  Created by Anton on 11.12.2018.
//  Copyright © 2018 RubicsGuide. All rights reserved.
//

import Foundation

struct Rozov3x3: Phases {
    func phase() -> String {
        let phase = "ROZOV3X3"
        return phase
    }
    
    func titles() -> [String] {
        return title
    }
    
    func images() -> [String] {
        return image
    }
    
    func descs() -> [String] {
        return description
    }
    
    func urls() -> [String] {
        return url
    }
    
    func comments() -> [String] {
        return []
    }
    
    let title = [
        st1_title,
        st2_title,
        st3_title,
        st4_title,
        st5_title,
        st6_title,
        st7_title,
        st8_title,
        st9_title]
    
    let image = [
        "main_1",
        "rozov_2",
        "rozov_3",
        "rozov_3",
        "rozov_3",
        "rozov_3",
        "rozov_3",
        "rozov_3",
        "rozov_3",
        "rozov_3"]
    
    let url = [
        st1_url,
        st2_url,
        st3_url,
        st4_url,
        st5_url,
        st6_url,
        st7_url,
        st8_url,
        st9_url
    ]
    
    
    let description = [
        st1_description,
        st2_description,
        st3_description,
        st4_description,
        st5_description,
        st6_description,
        st7_description,
        st8_description,
        st9_description]
    
    
    static let st1_title = "Устройство, Алгоритмы и Язык вращений кубика."
    static let st1_description = """
    <p>Несколько слов о том, как пользоваться программой:<br/>
    <a href="rg2://ytplay?time=8:22&link=u1CA_35lRAI">Выделенный текст</a> - это ссылки на те моменты в обучающем видео, о которых говорится втексте, так что если что-то непонятно, просто щелкните по ссылке в тексте и посмотрите видео.</p>

    <p><a href="rg2://ytplay?time=1:39&link=u1CA_35lRAI">Для начала</a> несколько слов об устройстве кубика и тех частях из которых он состоит.</p>

    <p>1. <a href="rg2://ytplay?time=1:46&link=u1CA_35lRAI">Центры.</a></p>
    <p style="text-align:center"><img src="rozov_1_1.xml" width="20%%"></p>
    
    <p>Элементы кубика имеющие всего одну наклейку. Отличительная особенность - положение центров относительно друг друга четко фиксировано, т.к. внутри кубика они жестко соединены крестовиной.</p>

    <p>2. <a href="rg2://ytplay?time=2:37&link=u1CA_35lRAI">Ребра.</a></p>
    <p style="text-align:center"><img src="rozov_1_2.xml" width="20%%"></p>
    
    <p>Элементы кубика, имеющие две наклейки.</p>

    <p>3. <a href="rg2://ytplay?time=3:25&link=u1CA_35lRAI">Углы.</a></p>
    <p style="text-align:center"><img src="rozov_1_3.xml" width="20%%"></p>

    <p>Элементы кубика, имеющие три наклейки.</p>

    <p>Теперь несколько слов о том, <a href="rg2://ytplay?time=3:52&link=u1CA_35lRAI">как крутить кубик Рубика</a> и о том, что такое алгоритмы. Как вы понимаете, каждую сторону кубика можно повернуть ПО или ПРОТИВ часовой стрелки. А последовательность из нескольких таких вращений называется <b>Алгоритмом</b>.</p>

    <p>Есть еще такое понятие, как Скрамбл. <b>Скрамбл</b> - это алгоритм по которому кубик не собирается, а разбирается. Т.е. алгоритм, который выполняют на собранном кубике, чтобы получить определенную ситуацию.</p>

    <p>Для того, чтобы записать Алгоритмы (вращения кубика), используется <b>Язык вращений</b>, т.е. особые обозначения движений сторон кубика, при помощи которых можно записать какой-либо алгоритм.</p>

    <p>У кубика шесть сторон, соответственно вращение каждой стороны обозначается соответствующей буквой:<br/><br/>

    <b>F</b> - <a href="rg2://ytplay?time=4:56&link=u1CA_35lRAI">Front</a> - фронтальная (передняя) сторона<br/>
    <b>B</b> - <a href="rg2://ytplay?time=5:07&link=u1CA_35lRAI">Back</a> - задняя сторона<br/>
    <b>L</b> - <a href="rg2://ytplay?time=5:21&link=u1CA_35lRAI">Left</a> - левая сторона<br/>
    <b>R</b> - <a href="rg2://ytplay?time=5:15&link=u1CA_35lRAI">Right</a> - правая сторона<br/>
    <b>U</b> - <a href="rg2://ytplay?time=5:28&link=u1CA_35lRAI">Up</a> - верхняя сторона<br/>
    <b>D</b> - <a href="rg2://ytplay?time=5:38&link=u1CA_35lRAI">Down</a> - нижняя сторона</p>

    <p>Если написана <a href="rg2://ytplay?time=5:49&link=u1CA_35lRAI">только буква,</a> значит крутим эту сторону по часовой стрелке так, как если бы мы смотрели прямо на эту грань (в лицо). <a href="rg2://ytplay?time=6:00&link=u1CA_35lRAI">Именно поэтому</a> R и L это вращения как бы в разные стороны.</p>

    <p>Если после буквы <a href="rg2://ytplay?time=6:25&link=u1CA_35lRAI">стоит штрих (\'),</a> например <b>F\'</b>, значит крутим эту сторону против часовой стрелки, как если бы мы смотрели прямо на эту грань.</p>

    <p>Если после буквы <a href="rg2://ytplay?time=6:44&link=u1CA_35lRAI">стоит двойка,</a> например <b>R2</b>, значит эту грань нужно повернуть дважды, т.е. на 180 градусов. Заметьте, что в какую сторону делать двойное вращение по или против
        часовой стрелки для кубика не имеет значения. В программе вы можете встретить и R2\', это означает лишь то, что в данном случае против часовой стрелки вращать будет удобнее, чем по часовой.</p>

    <p>Например, очень простой четырехходовый алгоритм, который называется <br/>
    <a href="rg2://ytplay?time=7:15&link=u1CA_35lRAI"><b>Пиф-паф:</a> R U R\' U\'</b></p>
    
    <p style="text-align:center"><img src="rozov_2_r.xml" width="10%%"><img src="rozov_2_u.xml" width="10%%"><img src="rozov_2_rb.xml" width="10%%"><img src="rozov_2_ub.xml" width="10%%"></p>

    <p>означает, что сначала нужно повернуть по часовой стрелке правую сторону (R), затем по часовой верхнюю (U), потом против часовой правую (R\') и против часовой верхнюю (U\').</p>

    <p>Если повторить данный алгоритм еще 5 раз, то кубик вернется в исходное положение.</p>

    <p>Более подробно с языком вращений различных головоломок вы можете ознакомиться в разделе программы \"Азбука вращений\" или нажав на знак вопроса в <a href="rg2://ytplay?time=8:22&link=u1CA_35lRAI">правом верхнем углу</a> экрана.</p>

    <p>Также в программе используется <a href="rg2://ytplay?time=8:36&link=u1CA_35lRAI">язык вращений</a> Максима Чечнева, который позволяет запоминать алгоритмы, составляя для них ассоциативные ряды. Основные понятия (движения) этого метода:<br/>
        <a href="rg2://ytplay?time=11:15&link=8VCsFNFa5yM"><b>\"Лондон\"</b></a> - передняя грань,<br/>
        <a href="rg2://ytplay?time=8:16&link=ku-FyZvD48Q"><b>\"свет\"</b></a> - правая грань<br/>
        и <a href="rg2://ytplay?time=7:58&link=8VCsFNFa5yM"><b>\"крыша\"</b></a> - верхняя грань.</p>

    <p>Например, для пиф-пафа ряд будет <a href="rg2://ytplay?time=10:18&link=u1CA_35lRAI">вот такой:</a> представьте, что вы проснулись ночью попить воды и <b>включили свет</b> (повернули правую грань по часовой стрелке) и от яркого света у вас <b>\"поехала крыша\"</b> (крутим верхнюю грань) тоже по часовой стрелке. Вы <b>выключили свет</b> (правая грань против часовой стрелки) и <b>\"крыша вернулась\"</b> на свое место (верхняя грань против часовой стрелки).</p>

        <p><i>Если вам что-то непонятно из текстового описания, вы можете посмотреть этот момент в видео, просто щелкнув по выделенному тексту.</i></p>
    """
    static let st1_url = "u1CA_35lRAI"
    
    static let st2_title = "Первый этап. Белый крест"
    static let st2_description = """
    <p>Я немного устал объяснять, что я не Максим Чечнев и почему в программе используется его обучалка для начинающих, поэтому настало время сделать свое видео и текстовку к нему. Я постарался сделать несложную, но в то же время быструю методику, чтобы освоив ее, вы познакомились со всеми базовыми алгоритмами (пиф-пафами), однозначно могли собрать кубик меньше чем за минуту, и при этом могли продолжить совершенствовать свои навыки, изучая все новые и новые алгоритмы, тем самым постепенно переходя на метод Джессики Фридрих (он же CFOP), которым собирают кубик большинство самых известных спидкуберов.</p>

    <p>Если вам что-то в этой методике будет непонятно, то попробуйте освоить более \"детскую\" методику <a href="rg2://pager?phase=BEGIN&item=1">от Максима Чечнева,</a> которая также приведена в программе. А чтобы вы могли это сделать на любом этапе, постараюсь в своей методике использовать терминологию Максима. Но лучше, просто щелкните на выделенный текст и посмотрите этот непонятный момент в видео, где все рассказано очень подробно.</p>

    <p>Как и в большинстве методик для начинающих, начнем сборку с креста на какой-либо стороне. Начинать сборку можно абсолютно с любой стороны, но чтобы было меньше путаницы, <a href="rg2://ytplay?time=2:09&link=QJ8-8l9dQ_U">начнем с белой.</a></p>

    <p>Итак, на первом этапе нам нужно собрать белый крест, т.е. поставить четыре ребра, у которых есть белая наклейка к белому центру, причем поставить их сразу так, чтобы вторая наклейка ребра соответствовала центру находящемуся сбоку от белого, т.е. ребра \"дружили\" с центрами.</p>

    <p style="text-align:center"><img src="rozov_2.xml" width="20%%"></p>

    <p>Надеюсь вы поняли, что серым цветом на картинках к этой обучалке обозначены элементы, цвет которых, на данный момент, не имеет никакого значения.</p>

    <p>А чтобы это сделать, нам понадобятся два очень простых, но очень и очень полезных алгоритма, которые нам еще не раз пригодятся. Про первый алгоритм я уже говорил выше - это <a href="rg2://ytplay?time=0:41&link=QJ8-8l9dQ_U"><b>пиф-паф</b></a> или в международном варианте он называется <a href="rg2://ytplay?time=0:06&link=4nSnsav3bIU"><b>Sexy move</b></a>. А второй алгоритм это <a href="rg2://ytplay?time=1:06&link=QJ8-8l9dQ_U"><b>Английский пиф-паф</b> или <b>Кувалда</b></a>, в международном варианте - <a href="rg2://ytplay?time=4:27&link=4nSnsav3bIU"><b>Sleagehammer</b></a>.</p>

    <p><a href="rg2://ytplay?time=0:41&link=QJ8-8l9dQ_U"><b>Пиф-паф</b></a></p>

    <p>Крутим правую грань по часовой стрелке (R), верхнюю по часовой (U), возвращаем правую на место (R\') и
        возвращаем на место верхнюю (U\'). Если выполнить данный алгоритм шесть раз, то кубик вернется
        в исходное положение.</p>

    <p style="text-align:center"><img src="rozov_2_r.xml" width="10%%"><img src="rozov_2_u.xml" width="10%%"><img src="rozov_2_rb.xml" width="10%%"><img src="rozov_2_ub.xml" width="10%%"></p>

    <p><a href="rg2://ytplay?time=0:51&link=QJ8-8l9dQ_U">Алгоритм:</a> <b>R U R\' U\'</b></p>

    <p><a href="rg2://ytplay?time=1:06&link=QJ8-8l9dQ_U"><b>Английский пиф-паф</b> или <b>Кувалда</b></a></p>

    <p>Крутим правую грань против часовой стрелки (R\'), переднюю по часовой (F), возвращаем на место правую (R) и возвращаем переднюю (F\'). Как и с простым пиф-пафом, если повторить данный алгоритм шесть раз, то кубик вернется в исходное состояние.</p>

    <p style="text-align:center"><img src="rozov_2_rb.xml" width="10%%"><img src="rozov_2_f.xml" width="10%%"><img src="rozov_2_r.xml" width="10%%"><img src="rozov_2_fb.xml" width="10%%"></p>

    <p><a href="rg2://ytplay?time=1:22&link=QJ8-8l9dQ_U">Алгоритм:</a> <b>R\' F R F\'</b></p>

    <p>Используя ассоциативный язык вращений Максима получится вот такая веселая поездка в Лондон (поэтому он и английский). Представьте, что вы выключаете дома свет, отправляетесь в Лондон, там очень весело отдыхаете, прямо \"зажигаете\", ну и после всего это возвращаетесь из Лондона. Ну а почему другое название \"Кувалда\" - <a href="rg2://ytplay?time=1:17&link=QJ8-8l9dQ_U">посмотрите в видео.</a></p>

    <p>Вот теперь <a href="rg2://ytplay?time=2:01&link=QJ8-8l9dQ_U">перейдем к сборке.</a> Для начала посмотрим на ребра, находящиеся рядом с белым центром, и если там есть какое-то белое ребро, то первым делом вращением этой белой грани
        его стоит совместить <a href="rg2://ytplay?time=2:28&link=QJ8-8l9dQ_U">со своим центром.</a></p>

    <p style="text-align:center"><img src="rozov_2_11.xml" width="20%%"></p>

    <p>Если рядом с белым центром оказалось не одно белое ребро, то просто совместите любое.</p>

    <p>Теперь нам необходимо <a href="rg2://ytplay?time=3:08&link=QJ8-8l9dQ_U">перевернуть кубик,</a> т.е. повернуть его так, чтобы белый центр оказался снизу, а желтый сверху.</p>

    <p style="text-align:center"><img src="rozov_2_2.xml" width="20%%"></p>

    <p>Представьте, что кубик это <a href="rg2://ytplay?time=3:17&link=QJ8-8l9dQ_U">трехэтажный дом,</a> у которого есть крыша (верхняя сторона), три этажа и подвал (нижняя сторона). И на нем нам надо найти белые ребра, т.е. как вы
        понимаете, они могут быть на крыше, на третьем этаже, на втором, на первом и в подвале. И чтобы нам было проще, искать мы их будем именно в такой последовательности, т.е. сверху вниз.</p>

    <p>И первым делом ищем белое ребро <a href="rg2://ytplay?time=3:37&link=QJ8-8l9dQ_U">на крыше</a> (верхней грани). Если мы его там находим, то крутим крышу так, чтобы ребро <a href="rg2://ytplay?time=3:52&link=QJ8-8l9dQ_U">оказалось справа,</a> а теперь будем крутить нижние два слоя так, чтобы цвет наклейки ребра находящейся сбоку (на третьем этаже) совпал с цветом бокового центра, т.е они подружились.</p>

    <p style="text-align:center"><img src="rozov_2_3.xml" width="20%%"></p>

        <p><a href="rg2://ytplay?time=4:16&link=QJ8-8l9dQ_U">Дважды</a> крутим правую грань (R2).
        Ребро встанет на нижний слой к белому центру и при этом продолжит \"дружить\" со своим боковым центром.</p>

        <p>Снова начинаем искать начиная с верхней грани. Если белого ребра там нет, значит, ищем
        белое ребро на <a href="rg2://ytplay?time=4:33&link=QJ8-8l9dQ_U">третьем этаже</a> нашего кубика.</p>
        <p style="text-align:center"><img src="rozov_2_4.xml" width="20%%"></p>

        <p>В этом случае, мы сначала должны развернуть ребро так, чтобы оно смотрело белой наклейкой
        наверх. А для этого берем кубик так, чтобы оно сначала смотрело
        <a href="rg2://ytplay?time=4:49&link=QJ8-8l9dQ_U">прямо на нас,</a></p>
        <p style="text-align:center"><img src="rozov_2_5.xml" width="20%%"></p>

        <p>и делаем английский пиф-паф (кувалду) <b>(R\' F R F\')</b>, можно сказать бьем по нему
        Кувалдой, чтобы оно стало \"правильным\". Ребро
        встанет белой наклейкой на крышу, причем сразу в нужное нам место, т.е. справа. Теперь
        крутим нижние два слоя так, чтобы центр совпал с цветом ребра
        и двойным движением правой грани ставим ребро на место.</p>

        <p>Если белого ребра нет ни на крыше, ни третьем этаже, значит ищем наше ребро
        <a href="rg2://ytplay?time=5:50&link=QJ8-8l9dQ_U">на втором этаже.</a>
        Что делать с таким ребром? Взять кубик так, чтобы ребро находилось спереди справа</p>
        <p style="text-align:center"><img src="rozov_2_6.xml" width="15%%"> или <img src="rozov_2_7.xml" width="15%%"></p>

        <p>Если белая наклейка смотрит на вас, значит, <a href="rg2://ytplay?time=6:10&link=QJ8-8l9dQ_U">ребро хорошее</a></p>
        <p style="text-align:center"><img src="rozov_2_6.xml" width="20%%"></p>

        <p><a href="rg2://ytplay?time=6:33&link=QJ8-8l9dQ_U">поднимаем ребро наверх</a> обычным
        <b>пиф-пафом</b> <b>(R U R\' U\')</b>,<br/>
        а если наклейка <a href="rg2://ytplay?time=6:33&link=QJ8-8l9dQ_U">смотрит в сторону</a></p>
        <p style="text-align:center"><img src="rozov_2_7.xml" width="20%%"></p>

        <p>то <a href="rg2://ytplay?time=7:24&link=QJ8-8l9dQ_U"><b>английским пиф-пафом (R\' F R F\')</b>.</a>
        А что делать когда белая наклейка на крыше, <a href="rg2://ytplay?time=7:39&link=QJ8-8l9dQ_U">вы уже знаете.</a></p>

        <p>Ну и если ребро находится на первом этаже, то берем кубик так, чтобы оно
        <a href="rg2://ytplay?time=8:04&link=QJ8-8l9dQ_U">было справа</a></p>
        <p style="text-align:center"><img src="rozov_2_8.xml" width="20%%"></p>

        <p>и двойным движением правой грани поднимаем его на третий этаж. А что с ним
        <a href="rg2://ytplay?time=8:04&link=QJ8-8l9dQ_U">делать дальше,</a>
        написано чуть выше. Поставить на переднюю грань, английский пиф-паф, постановка на место.</p>

        <p>Ну и <a href="rg2://ytplay?time=8:19&link=QJ8-8l9dQ_U">последний случай,</a> когда
        белых ребер нет ни на крыше, ни на боковых гранях - значит
        белый крест уже собран на нижней грани. Но что делать, если он
        <a href="rg2://ytplay?time=8:35&link=QJ8-8l9dQ_U">получился неправильным,</a> т.е.
        боковые цвета ребер не совпадают с цветами центров? Можно действовать по алгоритму 3-го
        этапа методики Максима Чечнева, но поскольку у нас белый центр находится снизу, лучше
        сделать по-другому.</p>
        <p style="text-align:center"><img src="rozov_2_9.xml" width="20%%"></p>

        <p>Ставим несовпадающее ребро справа, и двойным движением правой грани
        поднимаем его наверх, теперь вращением двух нижних слоев подгоняем к ребру его грань и снова
        дважды крутим правую грань (R2), тем самым поставив ребро на свое место и подняв другое неверно
        стоящее ребро на крышу. Так же вращением двух нижних слоев подгоняем к нему его грань
        и ставим ребро на место (R2).</p>

        <p>В итоге все белые ребра должны \"дружить\" со своими центрами.</p>
        <p style="text-align:center"><img src="rozov_2_10.xml" width="20%%"></p>

        <p><i>P.S. <a href="rg2://ytplay?time=9:41&link=QJ8-8l9dQ_U">Как ускорить</a> сборку креста:</i></p>

        <p><i>На самом деле, когда вы несколько раз соберете кубик и начнете его немного понимать, вы
        поймете, что многие действия из данной методики можно не делать в определенных случаях.
        Например, когда <a href="rg2://ytplay?time=10:04&link=QJ8-8l9dQ_U">ребро на втором этаже</a>
        и уже дружит со своим боковым центром, то его можно
        сразу опустить вниз (R\'), а не поднимать на третий этаж пиф-пафом.</i></p>

        <p><i>А когда ребро <a href="rg2://ytplay?time=10:30&link=QJ8-8l9dQ_U">на третьем этаже,</a>
        то можно поставить ребро справа, а нужный центр спереди и
        сделать только первые три хода английского пиф-пафа (R\' F R), ребро окажется на своем месте.</i></p>

        <p><i>Более того, открою небольшой секрет и скажу, что правильный крест из абсолютно любого положения
        собирается не более чем <a href="rg2://ytplay?time=11:16&link=QJ8-8l9dQ_U">за восемь вращений,</a>
        но это уже совсем другая история, которая более подробно рассмотрена в продвинутых
        методах сборки кубика (CFOP). Пример такой сборки
        <a href="rg2://ytplay?time=11:38&link=QJ8-8l9dQ_U">в видео.</a></i></p>

        <p><i>Если вам что-то непонятно из текстового описания, вы можете посмотреть этот момент в видео,
        просто щелкнув по выделенному тексту.</i></p>
    """
    static let st2_url = "QJ8-8l9dQ_U"
    
    static let st3_title = "Второй этап. Первый слой"
    static let st3_description = """
        <p>Теперь поставим на свои места белые углы, т.е. соберем не только белую сторону, но
        и <a href="rg2://ytplay?time=0:03&link=JP0RSBf_bh8">целиком первый слой.</a>.</p>
        <p style="text-align:center"><img src="rozov_3.xml" width="20%%"></p>

        <p>Кубик на данном этапе держим так же, как и на предыдущем, т.е. собранным
        <a href="rg2://ytplay?time=0:16&link=JP0RSBf_bh8">белым крестом вниз.</a>
        И теперь уже ищем углы с белой наклейкой.
        Прежде всего будем их искать <a href="rg2://ytplay?time=0:30&link=JP0RSBf_bh8">на крыше и третьем этаже,</a>
        т.е. смотрим вот на эти четыре элемента.</p>
        <p style="text-align:center"><img src="rozov_3_1.xml" width="20%%"></p>
        <p>Есть ли у кого-то из них белая наклейка?</p>

        <p>Например, находим <a href="rg2://ytplay?time=0:47&link=JP0RSBf_bh8">вот такой белый угол.</a>
        Берем кубик так, чтобы этот угол был спереди справа,</p>
        <p style="text-align:center"><img src="rozov_3_2.xml" width="20%%"></p>

        <p>И смотрим на <a href="rg2://ytplay?time=0:53&link=JP0RSBf_bh8">НЕ белые</a>
        наклейки этого уголка. В данном случае они: синяя и красная.
        И наша задача повернуть два нижних слоя так, чтобы цвета центров \"окружающих\" этот уголок были
        такими же, <a href="rg2://ytplay?time=1:04&link=JP0RSBf_bh8">как эти две наклейки.</a>
        Т.е. в данном случае нам нужно повернуть два нижних слоя вот до такого положения.</p>
        <p style="text-align:center"><img src="rozov_3_4.xml" width="20%%"></p>

        <p>Теперь уже смотрим <a href="rg2://ytplay?time=1:04&link=JP0RSBf_bh8">НА белую</a> наклейку.
        Возможны три ситуации, в зависимости от того, где она находится:</p>

        <p>1. <a href="rg2://ytplay?time=1:41&link=JP0RSBf_bh8">Наклейка сбоку,</a> как сказал
        бы Максим Чечнев, \"скромный\" угол.</p>
        <p style="text-align:center"><img src="rozov_3_4.xml" width="20%%"></p>

        <p>В этом случае достаточно сделать всего лишь
        <a href="rg2://ytplay?time=1:45&link=JP0RSBf_bh8">один простой пиф-паф</a> <b>R U R\' U\'</b>.</p>

        <p>2. <a href="rg2://ytplay?time=2:09&link=JP0RSBf_bh8">Наклейка спереди</a> (\"Наглый угол\")</p>
        <p style="text-align:center"><img src="rozov_3_5.xml" width="20%%"></p>
        Ну и если белая наклейка смотрит прямо на вас, то надо сделать
        <a href="rg2://ytplay?time=2:27&link=JP0RSBf_bh8">один английский пиф-паф</a>
        (кувалду) или пять простых пиф-пафов, что вам будет удобнее.

        <p>3. <a href="rg2://ytplay?time=2:50&link=JP0RSBf_bh8">Наклейка сверху</a> (\"Угол с завышенной самооценкой\")</p>
        <p style="text-align:center"><img src="rozov_3_3.xml" width="20%%"></p>
        Если белая наклейка сверху, то делаем <a href="rg2://ytplay?time=2:50&link=JP0RSBf_bh8">три любых пиф-пафа,</a>
        хоть обычных, хоть английских.

        <p>Далее находим <a href="rg2://ytplay?time=2:02&link=JP0RSBf_bh8">другой белый угол,</a>
        подгоняем к нему его место и делаем наши пиф-пафы. Повторяем для всех белых углов.</p>

        <p>Если еще не все уголки стоят на своих местах (нижний слой не собран), а на верхнем слое нет
        уголков с белым цветом, значит надо искать такой уголок
        <a href="rg2://ytplay?time=3:53&link=JP0RSBf_bh8">на нижнем слое.</a></p>

        Находим, берем кубик так, чтобы этот угол находился
        <a href="rg2://ytplay?time=3:53&link=JP0RSBf_bh8">справа внизу</a>
        <p style="text-align:center"><img src="rozov_3_6.xml" width="20%%"></p>

        <p>и делаем <a href="rg2://ytplay?time=4:32&link=JP0RSBf_bh8">простой пиф-паф.</a>
        Тем самым, <a href="rg2://ytplay?time=4:35&link=JP0RSBf_bh8">подняв этот угол</a> на верхний слой,
        а что с ним делать дальше - вы уже знаете, подогнать к нему его место и сделать нужные пиф-пафы.</p>

        <p><i>Если вам что-то непонятно из текстового описания, вы можете посмотреть этот момент в видео,
        просто щелкнув по выделенному тексту.</i></p>
    """
    static let st3_url = "JP0RSBf_bh8"
    
    static let st4_title = "Третий этап. Второй слой"
    static let st4_description = """
    <p>Теперь будем заниматься <a href="rg2://ytplay?time=4:51&link=JP0RSBf_bh8">ребрами второго этажа,</a>
        т.е. наша задача установить на свое место вот эти четыре ребра.</p>
        <p style="text-align:center"><img src="rozov_4_1.xml"></p>

        <p>Прежде всего нам необходимо найти одно из этих четырех ребер. Отличительная особенность этих ребер
        в том, что у них <a href="rg2://ytplay?time=5:06&link=JP0RSBf_bh8">нет желтой наклейки.</a>
        А вот искать эти ребра, в первую очередь надо как раз рядом с желтым центром, т.е.
        <a href="rg2://ytplay?time=5:21&link=JP0RSBf_bh8">на верхнем слое.</a></p>

        <p>Находим <a href="rg2://ytplay?time=5:35&link=JP0RSBf_bh8">такое ребро</a></p>
        <p style="text-align:center"><img src="rozov_4_2.xml"></p>

        <p>и совмещаем его со своим центром, собираем \"стебель Ромашки\".
        <a href="rg2://ytplay?time=5:41&link=JP0RSBf_bh8">Для этого</a> ставим его на переднюю грань
        и крутим два нижних слоя так, чтобы на передней грани наклейки найденного ребра и центра
        совпали. В данном случае, крутить будем до вот такого положения.</p>
        <p style="text-align:center"><img src="rozov_4_3.xml"></p>

        <p>Далее, необходимо определить, куда из этого положения пойдет ребро,
        <a href="rg2://ytplay?time=6:03&link=JP0RSBf_bh8">направо или налево?</a>
        Для этого необходимо сравнить верхний цвет нашего ребра с цветами центров находящихся
        на правой и левой гранях кубика. С какой стороны он совпадет, в ту сторону и нужно
        установить ребро. Будем называть эти случаи
        <a href="rg2://ytplay?time=6:17&link=JP0RSBf_bh8">\"Ромашка налево\"</a> и
        <a href="rg2://ytplay?time=6:29&link=JP0RSBf_bh8">\"Ромашка направо\".</a></p>
        <p style="text-align:center"><img src="rozov_4_6.xml"><img src="rozov_4_4.xml"></p>

        <p>А чтобы их решить, будем делать все
        <a href="rg2://ytplay?time=6:56&link=JP0RSBf_bh8">как-то \"неправильно\".</a></p>

        <p>Первая \"неправильная\" вещь - мы всегда старались все делать справа (углы ставили справа,
        белые ребра справа), а тут необходимо взять кубик так, чтобы место, куда мы будем загонять
        наше ребро (квартира ребра), оказалось слева.</p>
        <p style="text-align:center"><img src="rozov_4_10.xml"></p>

        <p>Второе, что нам необходимо сделать \"неправильно\", это то, куда поставить ребро на крыше.
        Для Правой ромашки его надо поставить на левую сторону, а для Левой ромашки на правую.</p>

        <p>Ну и третье, \"неправильное\" действие, это то, как
        <a href="rg2://ytplay?time=7:43&link=JP0RSBf_bh8">будем использовать</a> наши два пиф-пафа.
        Правую грань в этих алгоритмах будем вращать всегда
        <a href="rg2://ytplay?time=7:55&link=JP0RSBf_bh8">\"Жирно\",</a> т.е. вместе со средним слоем.</p>

        <p>1. <a href="rg2://ytplay?time=6:47&link=JP0RSBf_bh8">Для \"Ромашки направо\"</a></p>

        <p>Делаем перехват (y),</p>
        <p style="text-align:center"><img src="rozov_4_4.xml"> = (y) => <img src="rozov_4_5.xml"></p>

        <p>а теперь сначала \"жирный\" простой пиф-паф, а потом \"жирный\" английский пиф-паф.</p>

        <p><a href="rg2://ytplay?time=8:23&link=JP0RSBf_bh8">Алгоритм:</a> <b>(Rw U Rw\' U\') (Rw\' F Rw F\')</b></p>

        <p>2. <a href="rg2://ytplay?time=8:51&link=JP0RSBf_bh8">Для \"Ромашки налево\"</a></p>

        <p>Ставим ребро на правую грань (U\'),</p>
        <p style="text-align:center"><img src="rozov_4_6.xml"> = (U\') => <img src="rozov_4_7.xml"></p>

        <p>и теперь наоборот, сначала \"жирный\" английский пиф-паф, а потом \"жирный\" простой пиф-паф.</p>

        <p><a href="rg2://ytplay?time=9:20&link=JP0RSBf_bh8">Алгоритм:</a> <b>(Rw\' F Rw F\') (Rw U Rw\' U\')</b></p>

        <p>Если у вас сложилась ситуация, когда еще не все ребра среднего слоя стоят на своих местах,
        а ребра <a href="rg2://ytplay?time=10:50&link=JP0RSBf_bh8">без желтой наклейки</a> на
        верхнем слое нет, значит оно находится на среднем слое, но не на своем месте или на своем,
        но перевернуто. Например:</p>

        <p style="text-align:center"><img src="rozov_4_8.xml"> или <img src="rozov_4_9.xml"></p>

        <p>В этом случае, ставим на его место <a href="rg2://ytplay?time=11:31&link=JP0RSBf_bh8">любое другое ребро</a>
        (с желтой наклейкой), тем самым
        подняв наше ребро на верхний слой, а затем его устанавливаем его как обычно.</p>

        <p>Например для случая, когда ребро на своем месте, но перевернуто</p>
        <p style="text-align:center"><img src="rozov_4_8.xml"></p>
        <p>удобно будет <a href="rg2://ytplay?time=11:48&link=JP0RSBf_bh8">сделать так:</a> жирный
        простой пиф-паф, жирный английский пиф-паф,
        доворот крыши (U), и наоборот сначала жирный английский, а потом жирный простой пиф-пафы.</p>

        <p><i>P.S. В продвинутой методике этот и предыдущий этапы
        <a href="rg2://ytplay?time=13:11&link=JP0RSBf_bh8">делаются вместе,</a> т.е. углы нижнего слоя
        устанавливаются вместе с ребрами второго слоя, поэтому этап называется F2L (First 2 Layer или
        первые два слоя). За счет этого достигается значительный прирост в скорости сборки кубика,
        но в то же время, этот этап является одним из самых сложных в методике Фридрих.</i></p>
    """
    static let st4_url = "JP0RSBf_bh8"
    
    static let st5_title = "Четвертый этап. Желтый крест"
    static let st5_description = """
    """
    static let st5_url = "JUzXflZVsfI"
    
    static let st6_title = "Пятый этап. Разворот углов (красим крышу)"
    static let st6_description = """
    """
    static let st6_url = "JUzXflZVsfI"
    
    static let st7_title = "Шестой этап. Расстановка углов"
    static let st7_description = """
    """
    static let st7_url = "Rg57L2-k8z4"
    
    static let st8_title = "Седьмой этап. Расстановка ребер"
    static let st8_description = """
    """
    static let st8_url = "Rg57L2-k8z4"
    
    static let st9_title = "Ускорения для моей методики"
    static let st9_description = """
    """
    static let st9_url = "_ZqL3XwyoDE"
    
    static let st10_title = "Ускорение для F2L"
    static let st10_description = """
    """
    static let st10_url = "_ZqL3XwyoDE"
}
